In [48]:
import pandas as pd
import numpy as np
import ast

In [63]:
# Replace 'your_file.csv' with the actual path to your CSV file
#csv_file_path = '/home/aalmansour/source/lidc_slices/MNIST/four_raters/no_4raters_mnist.csv'

# Read the CSV file into a pandas DataFrame
#df = pd.read_csv(csv_file_path)

# Add an 'id' column with sequential numbers starting from 1
starting_value = 180001
#df['instance_id'] = range(starting_value, starting_value  + len(df))

# Save the modified DataFrame back to a new CSV file
#df.to_csv('/home/aalmansour/source/lidc_slices/MNIST/four_raters/no_agreement_4_mnist.csv', index=False)

In [86]:
csv_file_path = '/home/aalmansour/source/lidc_slices/MNIST/four_raters/full_test_data.csv'
df = pd.read_csv(csv_file_path)
#df.head()
df.tail()

,image_id,flattened_image,Label,agreement,instance_id
8995,14954,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",6,3,59954
8996,14957,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",4,3,59957
8997,14976,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",7,3,59976
8998,14991,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",4,3,59991
8999,15000,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",5,3,60000

In [75]:
#print(type(df['Flattened_Image'][0][0]))
print(type(df['flattened_image'][0]))
print(df['flattened_image'][0])
print(df['flattened_image'][0][0])

<class 'str'>
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18, 67, 125, 177, 177, 169, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 120, 221, 253, 253, 253, 253, 252, 191, 70, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 105, 229, 250, 253, 253, 253, 253, 253, 253, 253, 168, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 219, 253, 253, 254, 253, 207, 140, 88, 88, 93, 198, 239, 128, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 136, 253, 253, 253, 243, 88, 10, 0, 0, 0, 0, 20, 217, 205, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 136, 252, 251, 246, 195, 19, 0, 0, 0, 0, 0, 0, 46, 248, 195, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 124, 253, 253, 190, 31, 13, 0, 0, 0, 0, 0, 0, 7, 215, 240, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17, 231, 253, 163, 26, 0, 0, 0, 0, 0, 0, 0, 0, 94, 253, 94, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 167, 253, 253, 84, 0, 0, 0, 0, 0, 0, 0, 0, 39, 227, 215, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 115, 254, 254, 190, 10, 0, 0, 0, 0, 0, 0, 0, 95, 231, 248, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18, 173, 253, 239, 89, 0, 0, 0, 0, 0, 0, 27, 77, 227, 230, 179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 111, 253, 245, 73, 0, 0, 0, 0, 0, 0, 27, 160, 253, 232, 101, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 184, 253, 163, 0, 0, 0, 0, 0, 20, 100, 246, 253, 222, 95, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 82, 253, 232, 8, 0, 0, 0, 10, 90, 242, 255, 215, 107, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 206, 253, 197, 5, 0, 31, 94, 209, 253, 215, 151, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 201, 253, 202, 122, 194, 240, 253, 242, 160, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 57, 207, 253, 253, 224, 209, 151, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46, 66, 66, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
[

In [74]:
print(type(df['flattened_image'].values))
print(df['flattened_image'].values[0][0])

<class 'numpy.ndarray'>
[

In [87]:
df['flattened_image'] = df['flattened_image'].apply(lambda x: ast.literal_eval(x))

In [88]:
print(type(df['flattened_image'][2001]))
type(df['flattened_image'][2001][0])

<class 'list'>

int

In [84]:
np.array(df['flattened_image'][2001])

array([  0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,  22, 149, 154,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,  34, 140, 244, 253, 206,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,  66, 234, 252, 252, 215,  98,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,  43, 208, 236, 252, 252, 168,  21,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,  43, 230, 253, 252, 221,  43,
         2,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0, 155, 253, 242, 135,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0, 119, 236, 231,
        42,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,  13, 203,
       227,  48,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
        47, 252, 160,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,  99, 252,  56,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,  13, 212, 253,  46,   0,   0,   0,   0,   0,   0,
         3,  24,  24,  24,  24,  22,  11,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,  24, 252, 252, 119,   0,   0,   0,   0,
         0,   0,  97, 252, 252, 252, 252, 245, 203,  78,   9,   0,   0,
         0,   0,   0,   0,   0,   0,   0,  24, 252, 252, 185,  38,   0,
         0,   0,   0,   0, 138, 252, 252, 252, 252, 253, 252, 252, 129,
         0,   0,   0,   0,   0,   0,   0,   0,   0,  24, 252, 252, 252,
       232,  43,   0,   0,   0,   0,  25, 119, 160, 236, 210, 253, 252,
       252, 194,   9,   0,   0,   0,   0,   0,   0,   0,   0,   3,  96,
       221, 252, 252, 241, 157,  32,   0,   0,   0,   0,   0,  19,  12,
        33, 158, 252, 210,  12,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,  85, 218, 253, 255, 253, 253, 253,  96,  24,  24,  24,
       118,  34,  24, 118, 253, 161,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,  76, 248, 253, 252, 252, 252, 252, 253,
       252, 252, 252, 252, 253, 252, 252, 139,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0, 115, 253, 252, 252, 252,
       252, 253, 252, 252, 252, 252, 253, 252, 170,  13,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,  46, 177,
       252, 252, 252, 253, 252, 252, 252, 252, 203, 160,  44,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,  15,  54, 137, 137, 201, 178, 137, 137,  32,  11,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0])

In [85]:
df['flattened_image']

0       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
1       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
2       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
3       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
4       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
                              ...
8995    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
8996    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
8997    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
8998    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
8999    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
Name: flattened_image, Length: 9000, dtype: object

In [34]:
csv_file_path = '/home/aalmansour/source/lidc_slices/MNIST/four_raters/full_agreement_4_mnist.csv'
df = pd.read_csv(csv_file_path)
#df.head()
df.tail()

,image_id,flattened_image,Label,agreement,instance_id
59995,14996,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",9,3,59996
59996,14997,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",1,3,59997
59997,14998,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",8,3,59998
59998,14999,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",4,3,59999
59999,15000,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",5,3,60000

In [13]:
csv_file_path = '/home/aalmansour/source/lidc_slices/MNIST/four_raters/high_agreement_4_mnist.csv'
df = pd.read_csv(csv_file_path)
#df.head()
df.tail()

,image_id,flattened_image,Label,agreement,instance_id
59995,29996,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",6,2,119996
59996,29997,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",8,2,119997
59997,29998,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",9,2,119998
59998,29999,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",0,2,119999
59999,30000,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",6,2,120000

In [14]:
csv_file_path = '/home/aalmansour/source/lidc_slices/MNIST/four_raters/low_agreement_4_mnist.csv'
df = pd.read_csv(csv_file_path)
#df.head()
df.tail()

,image_id,flattened_image,agreement,Label,instance_id
59995,44996,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",1,4,179996
59996,44997,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",1,8,179997
59997,44998,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",1,5,179998
59998,44999,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",1,6,179999
59999,45000,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",1,9,180000

In [15]:
csv_file_path = '/home/aalmansour/source/lidc_slices/MNIST/four_raters/no_agreement_4_mnist.csv'
df = pd.read_csv(csv_file_path)
#df.head()
df.tail()

,image_id,flattened_image,id,agreement,Label,instance_id
59995,59996,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",59996,0,6,239996
59996,59997,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",59997,0,5,239997
59997,59998,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",59998,0,5,239998
59998,59999,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",59999,0,2,239999
59999,60000,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",60000,0,5,240000

In [3]:
print(len(df))

60000